// بيانات المنتجات — عدلها كما تشاء
const PRODUCTS = [
  {
    id: 'pdf-physics-01',
    name: 'Resume de course Physique en francais 2BAC  ',
    short: '📘 ملخص شامل في الفيزياء والكيمياء – السنة الثانية بكالوريا',
    description: 'ملخص شامل للفيزياء والكيمياء للسنة الثانية بكالوريا. يحتوي على ملخصات دقيقة ومنظمة لجميع الدروس، مع جداول تلخيصية ومخططات ذهنية لتسهيل المراجعة السريعة والتحضير للامتحانات..',
    price: 49,
    currency: 'MAD',
    images: [
      'asl.png',
      'Cpy1.png',
      'copy2.png'
    ],
    features: [
      '🎯 مميزات الملف:',
      ' مناسب للمراجعة السريعة قبل الفروض والامتحان الوطني',
      ' منظم حسب الوحدات الدراسية الرسمية',
      '20 صفحة PDF عالية الجودة',
      'ملف قابل للطباعة',
      ' يساعدك على التركيز على أهم النقاط دون تشتت',
      
    ],
    // رابط الشراء (Placeholder الآن) — سنستبدله لاحقًا برابط الدفع
    buyLink: 'https://wa.me/message/LWXDVOQC5JETC1'
  },
  {
    id: 'code-snippets-node',
    name: 'مجموعة واتساب لدراسة ',
    short: 'هده المجموعة عامة بحيت يمكن للجميع الدخول لها مجانا ولكن بشروط :',
    description: 'هده المجموعة عامة بحيت يمكن للجميع الدخول لها مجانا ولكن بشروط : 1- الإنضباط > 2-احترام اعضاء المجموعة > 3- العمل بجد',
    price: 0,
    currency: 'MAD',
    images: [
      '1.PNG',
      '2.PNG',
      '3.PNG',
    ],
    features: [
      ' 🎯مميزات هده المجموعة:',
      'العمل يوميا',
      'مشرف ذو خبرة سابقة',
      'التركيز على المواد الأساسية : فزياء رياضيات > svt'
    ],
    buyLink: 'https://chat.whatsapp.com/DqhSaVyj5KrHw5BRXWTm7e?mode=ems_copy_t'
  }
];

// يمكنك لاحقًا تبديل العملة والأسعار أو إضافة خصومات/رموز ترويجية هنا.